{"distractions":"\n        <h2>Distractions</h2>\n        <p>\n          There is probably no better way of expressing and preserving thoughts\n          than writing. I've wanted to document my ideas for multiple years now.\n          This turned out to be harder than expected: my brain decided it\n          wouldn't let me write and instead drift away into doing arbitrary\n          tasks. In the end - this paragraph took me 4 and a half years to\n          write.\n        </p>\n        <p>\n          When I put my mind to it - everything can become a distraction. I had\n          started the same way back then, in 2016: in front of a computer,\n          looking at an \"index.html document\" , when I realized, \"I want\n          colour!\". And not just any colour - the background and font colour was\n          supposed to change on every reload, but the contrast should still be\n          correct and everything was still supposed to be legible. 3 months of\n          looking into it to ended up in a mostly working website and I learned\n          a lot about luminance, HSL and different hues. But no text. Also - I\n          was tired of the whole blog idea and just went away for some time.\n        </p>\n        <p>\n          Fast forward two years or so - I was back. Armed with new explosive\n          enthusiasm to start all over, I was now ready to skip all the\n          distractions and dive straight into writing! Unfortunately, 2018-2019\n          were the years of the static site generator: Jekyll, Hugo and Gatsby\n          were big, Scully for Angular (big Angular user here) was released and\n          various other examples were taking the community by storm, empowering\n          writers to easily scaffold and format their content. Great products\n          like Medium were quickly gaining traction, which threw out the whole\n          idea of hosting your website or writing code altogether! This would\n          have been the perfect time to skip all the styling, jump straight into\n          the content and finally start the blog writing journey...\n        </p>\n        <p>\n          Nope! I live and breathe corporate. I wake up feeling like an\n          enterprise, and go to sleep thinking like business. \"Not Invented\n          Here\" (more about this in the future) flows deep within my veins: if I\n          am to use something, I better understand how it works! This lead down\n          a Wonderland-like rabbit hole and ended up with\n          <a href=\"https://github.com/bridzius/blankpage\" target=\"new_page\">blankpage</a>\n          - my take on a static site generator. Very basic, barely works, but\n          fully mine. This was a great distraction for a year or so of\n          off-and-on again development. Tinkering with code styling,\n          implementing Markdown support, making it somewhat pluggable (if it's\n          worth doing - it's worth overdoing) were great companions for early\n          morning espressos. Notice, how none of this involved writing any posts\n          yet. In the end - it sort of worked - maybe it will even work better\n          in the future - but I was still post-less. Fast forward one or two\n          more years.\n        </p>\n        <p>\n          Productivity hacking is all the rage now. We are taught to wake up\n          early (check), get at least some exercise in every day (yup), create\n          notes and reminders for the day and close them during the day (been\n          there) and many other things to get those little wins while we're\n          stuck at home for weeks on end. For me - the perfect time to start\n          writing. This time - no styling, no static site generation, no\n          templates. Just me, the keyboard and an \"index.html\".\n        </p>\n        <p>Here we go.</p>\n      "}
